Repository: jjaenal/backtest-x
Catalog: lib/l10n/app_*.arb
Languages: id

# tagline
source: Analyze • Backtest • Optimize
id: Analisis • Backtest • Optimasi

# data_upload_title
source: Upload Market Data
id: Unggah Data Pasar

# coach_timeframe_header
source: Coach Marks — Timeframe Impact
id: Coach Marks — Dampak Timeframe

# coach_timeframe_body
source: Timeframe affects indicators (EMA/RSI/VWAP, etc). 1H vs 4H can produce different signals. Use a consistent timeframe.
id: Timeframe mempengaruhi indikator (EMA/RSI/VWAP, dll). Data 1H vs 4H dapat menghasilkan sinyal berbeda. Gunakan timeframe yang konsisten.

# coach_timeframe_learn
source: Learn timeframe
id: Pelajari timeframe

# upload_no_file_selected
source: No file selected
id: Belum ada file yang dipilih

# upload_csv_format_hint
source: CSV format: Date, Open, High, Low, Close, Volume
id: Format CSV: Date, Open, High, Low, Close, Volume

# upload_select_csv_file
source: Select CSV File
id: Pilih File CSV

# upload_action_process
source: Upload & Process
id: Unggah & Proses

source: Validation Passed
id: Validasi Berhasil

source: Validation Failed
id: Validasi Gagal

# validation_errors_label
source: Errors:
id: Error:

source: Recent Uploads
id: Upload Terbaru

# candles_count_label
source: {count} candles
id: {count} candle

# no_market_data_info
source: No market data yet. You can activate sample data to try the app.
id: Tidak ada data pasar. Anda dapat mengaktifkan sample data untuk mencoba aplikasi.

# activate_sample_data_label
source: Activate Sample Data ({sample})
id: Aktifkan Sample Data ({sample})

# empty_no_uploads
source: No uploads yet
id: Belum ada upload data

# empty_upload_message
source: Select a CSV file and fill symbol to upload market data.
id: Pilih file CSV dan isi simbol untuk mengunggah market data.

# empty_upload_primary_label
source: Select CSV File
id: Pilih File CSV

# input_symbol_label
source: Symbol
id: Simbol

# input_symbol_hint
source: e.g. EURUSD, BTCUSDT
id: cth. EURUSD, BTCUSDT

# startup_init_services
source: Initialize services
id: Inisialisasi layanan

# startup_load_cache
source: Load cache
id: Muat cache

# startup_prepare_ui
source: Prepare UI
id: Siapkan UI

# login_post_redirect_banner
source: After login, you will be redirected to the requested page.
id: Setelah login, kamu akan diarahkan ke halaman yang diminta.

# login_forgot_password
source: Forgot Password?
id: Lupa Password?

# login_sign_in_email
source: Sign In with Email
id: Sign In dengan Email

# login_sign_up_email
source: Sign Up with Email
id: Sign Up dengan Email

# login_continue_google
source: Continue with Google
id: Lanjutkan dengan Google

# signup_title
source: Sign Up
id: Buat Akun

# signup_confirm_password_label
source: Confirm Password
id: Konfirmasi Password

# home_user_menu_tooltip
source: Account
id: Akun

# home_user_unknown
source: Unknown
id: Tidak diketahui

# home_user_sign_out
source: Sign Out
id: Keluar

# home_user_sign_in
source: Sign In
id: Masuk

# home_user_sign_up
source: Sign Up
id: Daftar

# home_user_change_password
source: Change Password
id: Ubah Kata Sandi

# home_change_password_success
source: Password updated successfully.
id: Password berhasil diubah.

# change_password_title
source: Set New Password
id: Atur Password Baru

# change_password_description
source: Enter a new password and confirm to update your account.
id: Masukkan password baru dan konfirmasi untuk mengubah password akun.

# change_password_new_label
source: New Password
id: Password Baru

# change_password_confirm_label
source: Confirm New Password
id: Konfirmasi Password Baru

# change_password_save_button
source: Save Password
id: Simpan Password Baru

# change_password_saving
source: Saving...
id: Menyimpan...

# common_cancel
source: Cancel
id: Batal

# error_password_min
source: Password must be at least 6 characters.
id: Password minimal 6 karakter.

# error_password_confirm_mismatch
source: Password confirmation does not match.
id: Konfirmasi password tidak cocok.

# password_strength_weak
source: Weak
id: Lemah

# password_strength_medium
source: Medium
id: Sedang

# password_strength_strong
source: Strong
id: Kuat

# error_invalid_email
source: Invalid email format.
id: Format email tidak valid.

# error_password_min_signup
source: Password must be at least 6 characters for signup.
id: Password minimal 6 karakter untuk pendaftaran.

# error_auth_invalid_credentials
source: Incorrect email or password.
id: Email atau password salah.

# error_auth_email_registered
source: Email is already registered.
id: Email sudah terdaftar.

# error_auth_email_not_confirmed
source: Email not verified. Check your inbox.
id: Email belum terverifikasi. Cek inbox untuk verifikasi.

# error_auth_generic
source: Authentication error. Please try again.
id: Terjadi kesalahan saat autentikasi. Coba lagi.

# error_generic
source: Something went wrong. Please try again.
id: Terjadi kesalahan. Coba lagi.

# home_tooltip_options
source: Options
id: Opsi

# home_action_upload_title
source: Upload Data
id: Unggah Data

# home_action_upload_subtitle
source: Import historical market data
id: Impor data pasar historis

# home_action_scanner_title
source: Pattern Scanner
id: Pendeteksi Pola

# home_action_scanner_subtitle
source: Detect candlestick patterns
id: Deteksi pola candlestick

# home_action_strategy_title
source: Create Strategy
id: Buat Strategi

# home_action_strategy_subtitle
source: Build your trading strategy
id: Bangun strategi trading Anda

# home_action_analysis_title
source: Market Analysis
id: Analisis Pasar

# home_action_analysis_subtitle
source: Analyze market data
id: Analisis data pasar

# home_action_workspace_subtitle
source: Manage strategies
id: Kelola strategi

# home_recent_strategies
source: Recent Strategies
id: Strategi Terbaru

# home_cache_warming
source: Cache: warming up
id: Cache: pemanasan

# home_cache_ready
source: Cache: ready
id: Cache: siap

# home_cache_empty
source: Cache: empty
id: Cache: kosong

# home_option_pause_bg
source: Pause Background Loading
id: Jeda Loading Background

# home_option_enable_bg
source: Enable Background Loading
id: Aktifkan Loading Background

# home_option_load_cache
source: Load Cache Now
id: Muat Cache Sekarang

# language_menu_system
source: Use System Language
id: Gunakan Bahasa Sistem

# language_menu_english
source: English
id: Bahasa Inggris

# language_menu_indonesian
source: Indonesian
id: Bahasa Indonesia

# startup_steps_done
source: All steps completed. Preparing app…
id: Semua langkah selesai. Menyiapkan aplikasi…

# home_loading_cache
source: Loading cache…
id: Memuat cache…

# home_running_backtest
source: Running backtest...
id: Menjalankan backtest...

# stats_strategies
source: Strategies
id: Strategi

# stats_data_sets
source: Data Sets
id: Set Data

# stats_tests_run
source: Tests Run
id: Tes Dijalankan

# last_result_header
source: Last Result
id: Hasil Terakhir

# edit_label
source: Edit
id: Ubah

# created_label
source: Created: {date}
id: Dibuat: {date}

# getting_started_title
source: Getting Started
id: Mulai

# empty_both
source: No data and strategies yet. Upload data and create your first strategy.
id: Belum ada data dan strategi. Unggah data dan buat strategi pertama.

# empty_no_data
source: No market data yet. Upload CSV to start backtesting.
id: Belum ada data market. Unggah CSV untuk mulai backtest.

# empty_no_strategy
source: No strategies yet. Create your first strategy to get started.
id: Belum ada strategi. Buat strategi pertama untuk memulai.

# metrics_trades
source: Trades
id: Transaksi

# metrics_profit_factor
source: Profit Factor
id: Faktor Profit

# metrics_max_drawdown
source: Max Drawdown
id: Drawdown Maks

source: View Details
id: Lihat Detail

# error_retry
source: Retry
id: Coba Lagi

# error_dismiss
source: Dismiss
id: Tutup

# clear_label
source: Clear
id: Bersihkan

# workspace_backtest_results_count
source: Backtest Results ({shown}/{total})
id: Hasil Backtest ({shown}/{total})

# dialog_got_it
source: Got it
id: Mengerti

# more_label
source: More
id: Lainnya

# delete_label
source: Delete
id: Hapus

source: Load more
id: Muat lagi

# workspace_tests
source: Tests
id: Tes

# workspace_avg_pnl
source: Avg P&L
id: Rata-rata P&L

# workspace_no_results
source: No backtest results yet
id: Belum ada hasil backtest

# filter_start_date
source: Start Date
id: Tanggal Mulai

# filter_end_date
source: End Date
id: Tanggal Selesai

# filter_start_label
source: Start:
id: Mulai:

# filter_end_label
source: End:
id: Selesai:

source: Copy Trades CSV
id: Salin CSV Transaksi

source: Copy Summary
id: Salin Ringkasan

source: Export CSV
id: Ekspor CSV

source: Export TSV
id: Ekspor TSV

source: Export All Trades CSV
id: Ekspor Semua Transaksi CSV

source: Export TF Stats CSV
id: Ekspor Statistik TF CSV

source: Export Results CSV
id: Ekspor Hasil CSV

# metric_tooltip_tests
source: Number of backtests executed for this strategy.
id: Jumlah backtest yang dijalankan untuk strategi ini.

# metric_tooltip_avg_pnl
source: Average profit/loss percentage across backtests.
id: Rata-rata persentase profit/kerugian di seluruh backtest.

# metric_tooltip_win_rate
source: Average percentage of winning trades across results.
id: Rata-rata persentase transaksi menang di seluruh hasil.

# metric_tooltip_pnl
source: Total profit or loss in currency for this result.
id: Total profit atau rugi dalam mata uang untuk hasil ini.

# metric_tooltip_pf
source: Profit Factor = gross profit divided by gross loss.
id: Profit Factor = total profit dibagi total rugi.

# metric_tooltip_default
source: Metric description
id: Deskripsi metrik

# relative_today
source: Today
id: Hari ini

# relative_yesterday
source: Yesterday
id: Kemarin

# relative_days_ago
source: {count} days ago
id: {count} hari lalu

# relative_weeks_ago
source: {count} weeks ago
id: {count} minggu lalu

# relative_months_ago
source: {count} months ago
id: {count} bulan lalu

# backtest_results_title
source: Backtest Results
id: Hasil Backtest

# export_label
source: Export
id: Ekspor

# export_per_tf_stats_tooltip
source: Export per-timeframe stats
id: Ekspor statistik per-timeframe

# export_trade_history_tooltip
source: Export trade history
id: Ekspor riwayat transaksi

# menu_export_chart_png
source: Export Chart PNG…
id: Ekspor Chart PNG…

# menu_export_panel_png
source: Export Panel PNG…
id: Ekspor Panel PNG…

# sb_exit_confirm_title
source: Exit Strategy Builder?
id: Keluar dari Strategy Builder?

# sb_exit_confirm_content
source: An autosave draft exists. Are you sure you want to close?
id: Ada draft di autosave. Yakin ingin menutup layar?

# sb_discard_and_exit
source: Discard & Exit
id: Discard & Keluar

# common_close
source: Close
id: Tutup

# sb_enable_autosave_title
source: Enable Autosave
id: Aktifkan Autosave

# sb_import_confirm_title
source: Confirm Import
id: Konfirmasi Impor

# sb_import_confirm_content
source: New template will overwrite current builder. Continue?
id: Template baru akan menimpa builder saat ini. Lanjutkan?

# sb_overwrite
source: Overwrite
id: Timpa

# sb_import_template_json_title
source: Import Template JSON
id: Impor Template JSON

# sb_apply
source: Apply
id: Terapkan

# sb_builder_tips
source: Builder Tips
id: Tips Builder

# sb_export_json
source: Export JSON
id: Ekspor JSON

# sb_copy_json
source: Copy JSON
id: Salin JSON

# sb_save_json
source: Save .json
id: Simpan .json

# sb_import_from_file
source: Import from .json file
id: Impor dari file .json

# sb_import_json_ellipsis
source: Import JSON...
id: Impor JSON...

# sb_saved_at_prefix
source: Saved at
id: Tersimpan pada

# sb_retry
source: Retry
id: Ulangi

# sb_discard_autosave_tooltip
source: Discard current autosave draft
id: Hapus draft autosave saat ini

# sb_discard
source: Discard
id: Buang

# sb_discard_draft
source: Discard Draft
id: Buang Draft

# sb_strategy_name_label
source: Strategy Name
id: Nama Strategi

# sb_strategy_name_hint
source: e.g. RSI Mean Reversion
id: mis. RSI Mean Reversion

# sb_initial_capital_label
source: Initial Capital
id: Modal Awal

# sb_risk_type_label
source: Risk Type
id: Tipe Risiko

# sb_risk_management_title
source: Risk Management
id: Manajemen Risiko

# sb_lot_size_label
source: Lot Size
id: Ukuran Lot

# sb_atr_multiple_label
source: ATR Multiple
id: Kelipatan ATR

# sb_risk_percentage_label
source: Risk Percentage
id: Persentase Risiko

# sb_take_profit_points
source: Take Profit (points)
id: Take Profit (poin)

# sb_select_market_data
source: Select Market Data
id: Pilih Data Market

# sb_view_full_results
source: View Full Results
id: Lihat Hasil Lengkap

# sb_indicator_label
source: Indicator
id: Indikator

# sb_main_period_label
source: Main Period
id: Periode Utama

# sb_main_period_hint
source: e.g. 14 or 20
id: mis. 14 atau 20

# sb_timeframe_optional_label
source: Timeframe (optional)
id: Timeframe (opsional)

# sb_use_base_timeframe
source: Use base timeframe
id: Gunakan timeframe dasar

# sb_number_label
source: Number
id: Angka

# sb_value_label
source: Value
id: Nilai

# sb_value_hint
source: e.g. 30, 70, 50
id: mis. 30, 70, 50

# sb_compare_with_label
source: Compare With
id: Bandingkan Dengan

# sb_period_label
source: Period
id: Periode

# sb_anchor_mode_label
source: Anchor Mode
id: Mode Anchor

# sb_start_of_backtest
source: Start of Backtest
id: Awal Backtest

# sb_anchor_by_date
source: Anchor by Date
id: Anchor berdasarkan Tanggal

# sb_anchor_date_label
source: Anchor Date (ISO)
id: Tanggal Anchor (ISO)

# sb_anchor_date_hint
source: YYYY-MM-DD or ISO
id: YYYY-MM-DD atau ISO

# sb_then_logic_label
source: Then (Logic)
id: Lalu (Logika)

# common_none
source: None
id: Tidak ada

# sb_search_template_hint
source: Search templates...
id: Cari template...

# sb_show_all_categories
source: Show all categories
id: Tampilkan semua kategori

# common_clear
source: Clear
id: Bersihkan

# sb_apply_filters
source: Apply
id: Terapkan

# sb_clear_filters
source: Clear filters
id: Bersihkan filter

# sb_pick_template_tooltip
source: Pick Template
id: Pilih Template

# sb_run_preview_tooltip
source: Run Preview
id: Jalankan Preview

# sb_stats_signals
source: Signals
id: Sinyal

# sb_stats_trades
source: Trades
id: Transaksi

# sb_stats_wins
source: Wins
id: Menang

# menu_export_chart_pdf
source: Export Chart PDF…
id: Ekspor Chart PDF…

# menu_export_chart_panel_pdf
source: Export Chart + Panel PDF…
id: Ekspor Chart + Panel PDF…

# menu_export_panel_pdf
source: Export Panel PDF…
id: Ekspor Panel PDF…

# menu_export_backtest_pdf
source: Export Backtest PDF
id: Ekspor Backtest PDF

# prompt_export_chart_png
source: Export Chart PNG
id: Ekspor Chart PNG

# prompt_export_panel_png
source: Export Panel PNG
id: Ekspor Panel PNG

# prompt_export_chart_pdf
source: Export Chart PDF
id: Ekspor Chart PDF

# prompt_export_panel_pdf
source: Export Panel PDF
id: Ekspor Panel PDF

# prompt_export_chart_panel_pdf
source: Export Chart + Panel PDF
id: Ekspor Chart + Panel PDF

# more_trades
source: + {count} more trades
id: + {count} transaksi lagi

# pattern_scanner_title
source: Pattern Scanner
id: Pendeteksi Pola

# ps_select_market_data
source: Select Market Data
id: Pilih Data Pasar

# ps_no_market_data
source: No market data available. Please upload data first.
id: Tidak ada data pasar. Unggah data terlebih dahulu.

# ps_select_market_hint
source: Select market data...
id: Pilih data pasar…

# ps_filters_header
source: Filters:
id: Filter:

# ps_empty_select_market
source: Select market data to scan
id: Pilih data pasar untuk discan

# ps_empty_select_hint
source: Choose a market data from dropdown above
id: Pilih data pasar dari dropdown di atas

# ps_no_patterns_found
source: No patterns found
id: Tidak ada pola ditemukan

# ps_try_adjust_filters
source: Try adjusting your filters
id: Coba sesuaikan filter Anda

# ps_candle_time
source: Time
id: Waktu

# ps_strength_weak
source: Weak
id: Lemah

# ps_strength_medium
source: Medium
id: Sedang

# ps_strength_strong
source: Strong
id: Kuat

# ps_patterns_guide_title
source: Candlestick Patterns Guide
id: Panduan Pola Candlestick

# ps_pattern_strong_bullish_cont
source: Strong Bullish Continuation
id: Bullish Kuat Berlanjut

# ps_pattern_strong_bearish_cont
source: Strong Bearish Continuation
id: Bearish Kuat Berlanjut

# ps_desc_strong_cont
source: Little to no wicks. Strong momentum in one direction. Indicates continuation of current trend.
id: Sedikit atau tanpa sumbu. Momentum kuat ke satu arah. Mengindikasikan kelanjutan tren saat ini.

# ps_desc_spinning_top
source: Small body with long wicks on both sides. Indicates uncertainty and potential reversal.
id: Body kecil dengan sumbu panjang di kedua sisi. Mengindikasikan ketidakpastian dan potensi pembalikan.

# market_analysis_title
source: Market Analysis
id: Analisis Pasar

# ma_refresh_tooltip
source: Refresh
id: Segarkan

# ma_chart_settings_tooltip
source: Chart Settings
id: Pengaturan Chart

# ma_select_market_label
source: Select Market
id: Pilih Pasar

# ma_no_market_data
source: No market data available
id: Tidak ada data pasar

# ma_select_market_hint
source: Select market...
id: Pilih pasar...

# ma_empty_select_market
source: Select market to analyze
id: Pilih pasar untuk dianalisis

# ma_price_statistics
source: Price Statistics
id: Statistik Harga

# ma_trend_analysis
source: Trend Analysis
id: Analisis Tren

# ma_volatility
source: Volatility
id: Volatilitas

# ma_data_quality
source: Data Quality
id: Kualitas Data

# ma_overview_current_label
source: Current
id: Saat Ini

# ma_overview_change_label
source: Change
id: Perubahan

# ma_trend_strength_label
source: Strength
id: Kekuatan

# ma_trend_uptrend
source: Uptrend
id: Tren Naik

# ma_trend_downtrend
source: Downtrend
id: Tren Turun

# ma_trend_sideways
source: Sideways
id: Mendatar

# ma_strength_unknown
source: Unknown
id: Tidak diketahui

# ma_volatility_high
source: High
id: Tinggi

# ma_volatility_medium
source: Medium
id: Sedang

# ma_volatility_low
source: Low
id: Rendah

# ma_volatility_unknown
source: Unknown
id: Tidak diketahui

# ma_price_highest
source: Highest
id: Tertinggi

# ma_price_lowest
source: Lowest
id: Terendah

# ma_price_average
source: Average
id: Rata-rata

# ma_price_range
source: Range
id: Rentang

# ma_volume_average
source: Average Volume
id: Rata-rata Volume

# ma_quality_valid_data
source: Valid Data
id: Data Valid

# ma_quality_complete_no_gaps
source: Complete (No Gaps)
id: Lengkap (Tanpa Celah)

# ma_quality_candles
source: Candles
id: Candle
